---
kind: enumMember
id: F:Autodesk.Revit.DB.IFCExportElement.Yes
enum: Autodesk.Revit.DB.IFCExportElement
source: html/0d321ff5-0373-81e9-dc0e-a0905a5fae8b.htm
---
# Autodesk.Revit.DB.IFCExportElement.Yes

Export element to IFC regardless of type or category settings.